# Grouping

<img src="Pandas_Images\Group.JPG">


### Pandas DataFrame groupby() Syntax

### The groupby() function syntax is:

In [ ]:
groupby(
        self,
        by=None,
        axis=0,
        level=None,
        as_index=True,
        sort=True,
        group_keys=True,
        squeeze=False,
        observed=False,
        **kwargs
    )

In [12]:
import pandas as pd
data = {'item' :['Books','Shoes','Coffee','Coffee','Books','Shoes','Books','Coffee','sugar'],
        'year':[2010,2010,2010,2011,2011,2011,2012,2012,2012],
        'sales':[1200,1050,500,1500,1200,1000,1230,1300,1420]}
df = pd.DataFrame(data,columns=['item','year','sales'])
df

     item  year  sales
0   Books  2010   1200
1   Shoes  2010   1050
2  Coffee  2010    500
3  Coffee  2011   1500
4   Books  2011   1200
5   Shoes  2011   1000
6   Books  2012   1230
7  Coffee  2012   1300
8   sugar  2012   1420

# Split Data into Groups

# Pandas object can be split into a group in many ways. A groups method is used to list group data.

Groupby using single column – It makes the group by using a single column.

In [13]:
item_group = df.groupby('item')
item_group.groups

{'Books': Int64Index([0, 4, 6], dtype='int64'),
 'Coffee': Int64Index([2, 3, 7], dtype='int64'),
 'Shoes': Int64Index([1, 5], dtype='int64'),
 'sugar': Int64Index([8], dtype='int64')}

# Groupby using multiple columns – It forms the group by using multiple columns.

In [14]:
item_group_M = df.groupby(['item','year'])
item_group_M.groups

{('Books', 2010): Int64Index([0], dtype='int64'),
 ('Books', 2011): Int64Index([4], dtype='int64'),
 ('Books', 2012): Int64Index([6], dtype='int64'),
 ('Coffee', 2010): Int64Index([2], dtype='int64'),
 ('Coffee', 2011): Int64Index([3], dtype='int64'),
 ('Coffee', 2012): Int64Index([7], dtype='int64'),
 ('Shoes', 2010): Int64Index([1], dtype='int64'),
 ('Shoes', 2011): Int64Index([5], dtype='int64'),
 ('sugar', 2012): Int64Index([8], dtype='int64')}

In [21]:
item_group.count()

        year  sales
item
Books      3      3
Coffee     3      3
Shoes      2      2
sugar      1      1

In [15]:
item_group.size()

item
Books     3
Coffee    3
Shoes     2
sugar     1
dtype: int64

In [16]:
item_group.describe()

        year                                                              \
       count    mean       std     min      25%     50%      75%     max
item
Books    3.0  2011.0  1.000000  2010.0  2010.50  2011.0  2011.50  2012.0
Coffee   3.0  2011.0  1.000000  2010.0  2010.50  2011.0  2011.50  2012.0
Shoes    2.0  2010.5  0.707107  2010.0  2010.25  2010.5  2010.75  2011.0
sugar    1.0  2012.0       NaN  2012.0  2012.00  2012.0  2012.00  2012.0

       sales
       count    mean         std     min     25%     50%     75%     max
item
Books    3.0  1210.0   17.320508  1200.0  1200.0  1200.0  1215.0  1230.0
Coffee   3.0  1100.0  529.150262   500.0   900.0  1300.0  1400.0  1500.0
Shoes    2.0  1025.0   35.355339  1000.0  1012.5  1025.0  1037.5  1050.0
sugar    1.0  1420.0         NaN  1420.0  1420.0  1420.0  1420.0  1420.0

# GroupBy sorting

By default the group keys are sorted during the groupby operation. You may however pass sort=False for potential speedups:

In [2]:
import pandas as pd 
df2 = pd.DataFrame({'X': ['B', 'B', 'A', 'A'], 'Y': [1, 2, 3, 4]})
df2.groupby(['X']).sum()

   Y
X
A  7
B  3

In [3]:
df2.groupby(['X'], sort=False).sum()

   Y
X
B  3
A  7

# Grouping DataFrame with Index levels and columns

A DataFrame may be grouped by a combination of columns and index levels by specifying the column names as strings and the index levels as pd.Grouper objects.

In [7]:
import numpy as np
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
         ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

In [9]:
df = pd.DataFrame({'A': [1, 1, 1, 1, 2, 2, 3, 3],
                       'B': np.arange(8)},
                     index=index)
df

              A  B
first second
bar   one     1  0
      two     1  1
baz   one     1  2
      two     1  3
foo   one     2  4
      two     2  5
qux   one     3  6
      two     3  7

The following example groups df by the second index level and the A column.

In [10]:
df.groupby([pd.Grouper(level=1), 'A']).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

Index levels may also be specified by name.

In [11]:
df.groupby([pd.Grouper(level='second'), 'A']).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

# Iterating through Groups

In [10]:
for name,group in item_group:
    print('{}:'.format(name))
    print(group)

Books:
    item  year  sales
0  Books  2010   1200
4  Books  2011   1200
6  Books  2012   1230
Coffee:
     item  year  sales
2  Coffee  2010    500
3  Coffee  2011   1500
7  Coffee  2012   1300
Shoes:
    item  year  sales
1  Shoes  2010   1050
5  Shoes  2011   1000
sugar:
    item  year  sales
8  sugar  2012   1420

# Selecting a Group
The get_group() method is used to select a particular group.

In [11]:
item_group.get_group('Coffee')

     item  year  sales
2  Coffee  2010    500
3  Coffee  2011   1500
7  Coffee  2012   1300

# Groupby – Aggregations

Use aggregation function such as mean, sum, etc to get the aggregate value of each group. Aggregation functions are used once the group by object is created.

Example: Let’s calculate the average sales of each item.

In [12]:
agg_group = df.groupby('item')['sales'].mean()
agg_group

item
Books     1210
Coffee    1100
Shoes     1025
sugar     1420
Name: sales, dtype: int64

Aggregation group for Multiple columns – You can make groups for aggregation value by using multiple columns

Example: Let’s calculate the average and total sales of each item.

In [14]:
import numpy as np
agg_group = df.groupby('item')['sales'].agg([np.mean,np.sum])
print(agg_group)

        mean   sum
item
Books   1210  3630
Coffee  1100  3300
Shoes   1025  2050
sugar   1420  1420

In [15]:
import numpy as np
agg_group = df.groupby('item')['sales'].agg(COUNT='count',Standard_deviation=np.std)
agg_group

        COUNT  Standard_deviation
item
Books       3           17.320508
Coffee      3          529.150262
Shoes       2           35.355339
sugar       1                 NaN

<img src="Pandas_Images\Group_Methods.JPG">

In [20]:
grouped = df.groupby('item')
grouped['sales'].agg([np.sum, np.mean, np.std])

         sum  mean         std
item
Books   3630  1210   17.320508
Coffee  3300  1100  529.150262
Shoes   2050  1025   35.355339
sugar   1420  1420         NaN

# Applying multiple functions at once

In [22]:
grouped['sales'].agg(['sum', 'min'])

         sum   min
item
Books   3630  1200
Coffee  3300   500
Shoes   2050  1000
sugar   1420  1420

In [23]:
grouped['sales'].agg([lambda x: x.max() - x.min(),
                    lambda x: x.median() - x.mean()])

        <lambda_0>  <lambda_1>
item
Books           30         -10
Coffee        1000         200
Shoes           50           0
sugar            0           0

# Enumerate group items

To see the order in which each row appears within its group, use the cumcount method:

In [26]:
import pandas as pd
data = {'item' :['Books','Shoes','Coffee','Coffee','Books','Shoes','Books','Coffee','sugar'],
        'year':[2010,2010,2010,2011,2011,2011,2012,2012,2012],
        'sales':[1200,1050,500,1500,1200,1000,1230,1300,1420]}
df = pd.DataFrame(data,columns=['item','year','sales'])
df

     item  year  sales
0   Books  2010   1200
1   Shoes  2010   1050
2  Coffee  2010    500
3  Coffee  2011   1500
4   Books  2011   1200
5   Shoes  2011   1000
6   Books  2012   1230
7  Coffee  2012   1300
8   sugar  2012   1420

In [27]:
df.groupby('item').cumcount()

0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    0
dtype: int64

In [29]:
df.groupby('item').size()

item
Books     3
Coffee    3
Shoes     2
sugar     1
dtype: int64

# Taking the nth row of each group

In [34]:
g= df.groupby('year')
g.nth(0)

        item  sales
year
2010   Books   1200
2011  Coffee   1500
2012   Books   1230

In [35]:
g.nth(-1)

        item  sales
year
2010  Coffee    500
2011   Shoes   1000
2012   sugar   1420

# Filteration
The filter method returns a subset of the original object.  Suppose we want to find the item, which is sale for less than three years.

In [16]:
df.groupby('item').filter(lambda x: len(x) < 3 )

    item  year  sales
1  Shoes  2010   1050
5  Shoes  2011   1000
8  sugar  2012   1420

In [26]:
globalsym = {}
sample = '"ABC"'
globalsym['sample'] = '"ABC"'

In [27]:
globalsym

{'sample': '"ABC"'}

In [ ]:
print(b);

In [24]:
sf = pd.Series([1, 1, 2, 3, 3, 3])

In [25]:
sf.groupby(sf).filter(lambda x: x.sum() > 2)

3    3
4    3
5    3
dtype: int64